In [1]:
# Librerías a utilizar
import pandas as pd #dataframe
import os #direcciones
import numpy as np

In [2]:
os.getcwd()

path='C:\\Users\\nereida.combariza\\Documents\\cosas de python\\original'

os.chdir(path)

In [3]:
os.getcwd()

'C:\\Users\\nereida.combariza\\Documents\\cosas de python\\original'

In [4]:
tabla_modelos = pd.read_csv('TABLA_MODELOS.txt',encoding = 'ansi', sep='\t')
tabla_modelos.head(2) #Para ver el encabezado

,Grupo_linea,GRUPO_CREDITO,C_Nombre_Plan,GrupoModelo
0,2001,CONSUMO ORDINARIO,CONSUMO ORDINARIO,7
1,2002,CONSUMO CUPO ROTATIVO“TARJETA FE”,TARJETA,3

In [5]:
tabla_modelos.shape

(231, 4)

In [6]:
type(tabla_modelos)

pandas.core.frame.DataFrame

In [7]:
tabla_modelos.dtypes

Grupo_linea       int64
GRUPO_CREDITO    object
C_Nombre_Plan    object
GrupoModelo       int64
dtype: object

In [8]:
path='C:\\Users\\nereida.combariza\\Documents\\cosas de python'
os.chdir(path)

In [9]:
tabla_productos = pd.read_csv('Tabla Productos 16_05_2019.txt',encoding = 'ansi', sep='\t')
tabla_productos.dtypes

Linea de Credito              int64
Tipo de Linea (Modalidad)    object
Descripción de la Linea      object
COD PRODUCTO                 object
NOMBRE PRODUCTO              object
MODALIDAD                    object
dtype: object

In [10]:
tabla_productos.head(10)

,Linea de Credito,Tipo de Linea (Modalidad),Descripción de la Linea,COD PRODUCTO,NOMBRE PRODUCTO,MODALIDAD
0,2001,Consumo,CONSUMO ORDINARIO,CN18,ORDINARIO,CONSUMO
1,2002,Consumo,TARJETA,CN56,CONSUMO ROTATIVO MIGRADO,CONSUMO
2,2003,Consumo,LIBRANZA,CN21,LIBRANZA,CONSUMO
3,2004,Consumo,EMPLEADOS FINAM. VIVIENDA,CN18,ORDINARIO,CONSUMO
4,2005,Consumo,CONSUMO MICROFINANZAS,CN14,CONSUMO MICROFINANZAS,CONSUMO
5,2006,Consumo,POLIZA EXEQUIAL,CN18,ORDINARIO,CONSUMO
6,2007,Consumo,EMPLEADOS FINAM. CONSUMO,N/A,N/A,N/A
7,2008,Consumo,CONSUMO PROVEEDORES,CN18,ORDINARIO,CONSUMO
8,2009,Consumo,VEHICULO,CN11,VEHICULO,CONSUMO
9,2010,Consumo,EXTRACUPO CONSUMO,CN18,ORDINARIO,CONSUMO

In [11]:
tabla_productos.columns

Index(['Linea de Credito', 'Tipo de Linea (Modalidad)',
       'Descripción de la Linea', 'COD PRODUCTO', 'NOMBRE PRODUCTO',
       'MODALIDAD'],
      dtype='object')

In [12]:
tabla_productos=tabla_productos[['Linea de Credito', 'COD PRODUCTO']]

In [13]:
tabla_productos.head()

   Linea de Credito COD PRODUCTO
0              2001        CN18
1              2002        CN56
2              2003        CN21
3              2004        CN18
4              2005        CN14

In [14]:
tabla_productos.columns=['linea', 'producto']

In [15]:
tabla_productos.head()

   linea producto
0   2001    CN18
1   2002    CN56
2   2003    CN21
3   2004    CN18
4   2005    CN14

In [ ]:
??merge

In [16]:
tabla_modelos.columns

Index(['Grupo_linea', 'GRUPO_CREDITO', 'C_Nombre_Plan', 'GrupoModelo'], dtype='object')

In [28]:
tabla_modelos2=tabla_modelos.merge(tabla_productos, how='left' , left_on='Grupo_linea', right_on='linea')
print(tabla_modelos.shape)
print(tabla_modelos2.shape)

In [29]:
tabla_modelos2.head()

,Grupo_linea,GRUPO_CREDITO,C_Nombre_Plan,GrupoModelo,linea,producto
0,2001,CONSUMO ORDINARIO,CONSUMO ORDINARIO,7,2001,CN18
1,2002,CONSUMO CUPO ROTATIVO“TARJETA FE”,TARJETA,3,2002,CN56
2,2003,LIBRANZA',LIBRANZA,7,2003,CN21
3,2005,CONSUMO MICROFINANZAS',CONSUMO MICROFINANZAS,4,2005,CN14
4,2009,VEHÍCULO,VEHICULO,5,2009,CN11

In [30]:
tabla_modelos2=tabla_modelos2.drop(['Grupo_linea'], axis=1)

In [31]:
tabla_modelos2.head()

,GRUPO_CREDITO,C_Nombre_Plan,GrupoModelo,linea,producto
0,CONSUMO ORDINARIO,CONSUMO ORDINARIO,7,2001,CN18
1,CONSUMO CUPO ROTATIVO“TARJETA FE”,TARJETA,3,2002,CN56
2,LIBRANZA',LIBRANZA,7,2003,CN21
3,CONSUMO MICROFINANZAS',CONSUMO MICROFINANZAS,4,2005,CN14
4,VEHÍCULO,VEHICULO,5,2009,CN11

In [36]:
new_order = [4,0,1,2,3]
tabla_modelos2=tabla_modelos2[tabla_modelos2.columns[new_order]]

In [37]:
tabla_modelos2.head()

,producto,GRUPO_CREDITO,C_Nombre_Plan,GrupoModelo,linea
0,CN18,CONSUMO ORDINARIO,CONSUMO ORDINARIO,7,2001
1,CN56,CONSUMO CUPO ROTATIVO“TARJETA FE”,TARJETA,3,2002
2,CN21,LIBRANZA',LIBRANZA,7,2003
3,CN14,CONSUMO MICROFINANZAS',CONSUMO MICROFINANZAS,4,2005
4,CN11,VEHÍCULO,VEHICULO,5,2009

In [38]:
tabla_modelos2.columns

Index(['producto', 'GRUPO_CREDITO', 'C_Nombre_Plan', 'GrupoModelo', 'linea'], dtype='object')

In [49]:
path_out='C:\\Users\\nereida.combariza\\Documents\\cosas de python\\homologado'
os.chdir(path_out)

In [51]:
tabla_modelos2.to_csv('TABLA_MODELOS.txt', index=False, sep='\t')